ConfNet_1600_noF

Learning rate: 0.0001
Loss type: Binary_Cross_Entropy
Task type: Classification
Neighbourhood size: 13
Cost volume depth: 192
# Neighbourhood filter: 32
# Depth filter: 32
# Depth layers: 10
# Dense filter: 16
# Additional dense layers: 0

Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
INPUT_RGB (InputLayer)          [(None, None, None,  0                                            
__________________________________________________________________________________________________
INPUT_DISP (InputLayer)         [(None, None, None,  0                                            
__________________________________________________________________________________________________
CONV1_RGB (Conv2D)              (None, None, None, 3 896         INPUT_RGB[0][0]                  
__________________________________________________________________________________________________
CONV1_DISP (Conv2D)             (None, None, None, 3 320         INPUT_DISP[0][0]                 
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, None, None, 6 0           CONV1_RGB[0][0]                  
                                                                 CONV1_DISP[0][0]                 
__________________________________________________________________________________________________
ENCODING1 (Conv2D)              (None, None, None, 6 36928       concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, None, None, 6 256         ENCODING1[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Relu (TensorFlowOpL [(None, None, None,  0           batch_normalization[0][0]        
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, None, None, 6 0           tf_op_layer_Relu[0][0]           
__________________________________________________________________________________________________
ENCODING2 (Conv2D)              (None, None, None, 1 73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, None, 1 512         ENCODING2[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Relu_1 (TensorFlowO [(None, None, None,  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, None, None, 1 0           tf_op_layer_Relu_1[0][0]         
__________________________________________________________________________________________________
ENCODING3 (Conv2D)              (None, None, None, 2 295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, None, 2 1024        ENCODING3[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Relu_2 (TensorFlowO [(None, None, None,  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, None, None, 2 0           tf_op_layer_Relu_2[0][0]         
__________________________________________________________________________________________________
ENCODING4 (Conv2D)              (None, None, None, 5 1180160     max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, None, 5 2048        ENCODING4[0][0]                  
__________________________________________________________________________________________________
tf_op_layer_Relu_3 (TensorFlowO [(None, None, None,  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, None, None, 5 0           tf_op_layer_Relu_3[0][0]         
__________________________________________________________________________________________________
DECODING1_DECON (Conv2DTranspos (None, None, None, 2 1179904     max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, None, 7 0           DECODING1_DECON[0][0]            
                                                                 ENCODING4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, None, 7 3072        concatenate_1[0][0]              
__________________________________________________________________________________________________
DECODING1_CONV (Conv2D)         (None, None, None, 2 1769728     batch_normalization_4[0][0]      
__________________________________________________________________________________________________
tf_op_layer_Relu_4 (TensorFlowO [(None, None, None,  0           DECODING1_CONV[0][0]             
__________________________________________________________________________________________________
DECODING2_DECON (Conv2DTranspos (None, None, None, 1 295040      tf_op_layer_Relu_4[0][0]         
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, None, 3 0           DECODING2_DECON[0][0]            
                                                                 ENCODING3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, None, 3 1536        concatenate_2[0][0]              
__________________________________________________________________________________________________
DECODING2_CONV (Conv2D)         (None, None, None, 1 442496      batch_normalization_5[0][0]      
__________________________________________________________________________________________________
tf_op_layer_Relu_5 (TensorFlowO [(None, None, None,  0           DECODING2_CONV[0][0]             
__________________________________________________________________________________________________
DECODING3_DECON (Conv2DTranspos (None, None, None, 6 73792       tf_op_layer_Relu_5[0][0]         
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, None, None, 1 0           DECODING3_DECON[0][0]            
                                                                 ENCODING2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, None, 1 768         concatenate_3[0][0]              
__________________________________________________________________________________________________
DECODING3_CONV (Conv2D)         (None, None, None, 6 110656      batch_normalization_6[0][0]      
__________________________________________________________________________________________________
tf_op_layer_Relu_6 (TensorFlowO [(None, None, None,  0           DECODING3_CONV[0][0]             
__________________________________________________________________________________________________
DECODING4_DECON (Conv2DTranspos (None, None, None, 3 18464       tf_op_layer_Relu_6[0][0]         
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, None, None, 9 0           DECODING4_DECON[0][0]            
                                                                 concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, None, 9 384         concatenate_4[0][0]              
__________________________________________________________________________________________________
DECODING4_CONV (Conv2D)         (None, None, None, 3 27680       batch_normalization_7[0][0]      
__________________________________________________________________________________________________
tf_op_layer_Relu_7 (TensorFlowO [(None, None, None,  0           DECODING4_CONV[0][0]             
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, None, None, 1 289         tf_op_layer_Relu_7[0][0]         
==================================================================================================
Total params: 5,514,977
Trainable params: 5,510,177
Non-trainable params: 4,800
__________________________________________________________________________________________________
