LGC_noF3

Learning rate: 0.0001
Loss type: Binary_Cross_Entropy
Task type: Classification
Neighbourhood size: 13
Cost volume depth: 192
# Neighbourhood filter: 32
# Depth filter: 32
# Depth layers: 10
# Dense filter: 16
# Additional dense layers: 0

Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
INPUT_LOCAL (InputLayer)        [(None, None, None,  0                                            
__________________________________________________________________________________________________
INPUT_GLOBAL (InputLayer)       [(None, None, None,  0                                            
__________________________________________________________________________________________________
INPUT_DISP (InputLayer)         [(None, None, None,  0                                            
__________________________________________________________________________________________________
tf_op_layer_Mul (TensorFlowOpLa [(None, None, None,  0           INPUT_LOCAL[0][0]                
__________________________________________________________________________________________________
tf_op_layer_Mul_1 (TensorFlowOp [(None, None, None,  0           INPUT_GLOBAL[0][0]               
__________________________________________________________________________________________________
CONV_DISP_1 (Conv2D)            (None, None, None, 6 640         INPUT_DISP[0][0]                 
__________________________________________________________________________________________________
CONV_LOCAL_1 (Conv2D)           (None, None, None, 6 640         tf_op_layer_Mul[0][0]            
__________________________________________________________________________________________________
CONV_GLOBAL_1 (Conv2D)          (None, None, None, 6 640         tf_op_layer_Mul_1[0][0]          
__________________________________________________________________________________________________
CONV_DISP_2 (Conv2D)            (None, None, None, 6 36928       CONV_DISP_1[0][0]                
__________________________________________________________________________________________________
CONV_LOCAL_2 (Conv2D)           (None, None, None, 6 36928       CONV_LOCAL_1[0][0]               
__________________________________________________________________________________________________
CONV_GLOBAL_2 (Conv2D)          (None, None, None, 6 36928       CONV_GLOBAL_1[0][0]              
__________________________________________________________________________________________________
CONV_DISP_3 (Conv2D)            (None, None, None, 6 36928       CONV_DISP_2[0][0]                
__________________________________________________________________________________________________
CONV_LOCAL_3 (Conv2D)           (None, None, None, 6 36928       CONV_LOCAL_2[0][0]               
__________________________________________________________________________________________________
CONV_GLOBAL_3 (Conv2D)          (None, None, None, 6 36928       CONV_GLOBAL_2[0][0]              
__________________________________________________________________________________________________
CONV_DISP_4 (Conv2D)            (None, None, None, 6 36928       CONV_DISP_3[0][0]                
__________________________________________________________________________________________________
CONV_LOCAL_4 (Conv2D)           (None, None, None, 6 36928       CONV_LOCAL_3[0][0]               
__________________________________________________________________________________________________
CONV_GLOBAL_4 (Conv2D)          (None, None, None, 6 36928       CONV_GLOBAL_3[0][0]              
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, None, None, 1 0           CONV_DISP_4[0][0]                
                                                                 CONV_LOCAL_4[0][0]               
                                                                 CONV_GLOBAL_4[0][0]              
__________________________________________________________________________________________________
FC1 (Conv2D)                    (None, None, None, 1 19300       concatenate[0][0]                
__________________________________________________________________________________________________
FC2 (Conv2D)                    (None, None, None, 1 10100       FC1[0][0]                        
__________________________________________________________________________________________________
PREDICTION (Conv2D)             (None, None, None, 1 101         FC2[0][0]                        
==================================================================================================
Total params: 363,773
Trainable params: 363,773
Non-trainable params: 0
__________________________________________________________________________________________________
